{
  "tjZJ0hbW7tD1I21hCS41": {
    "name": "Centered",
    "description": "A pioneering mental health center offering affordable, multidisciplinary care. From traditional therapy to advanced psychiatric care and ketamine-assisted therapy, we provide a full spectrum of services.",
    "website": "https://centered.one",
    "services": [
      {
        "name": "Traditional Therapy",
        "description": "Evidence-based psychotherapy approaches for mental health support"
      },
      {
        "name": "Advanced Psychiatric Care",
        "description": "Comprehensive psychiatric evaluation and medication management"
      },
      {
        "name": "Ketamine-Assisted Therapy",
        "description": "Innovative ketamine therapy for treatment-resistant depression and other conditions"
      }
    ],
    "policies": {
      "nonDiscrimination": "Centered does not discriminate on the basis of race, color, national origin, sex, gender identity or expression, affectional or sexual orientation, age, disability, religion or belief, marital status, veteran status, English language proficiency, or HIV status.",
      "safeSpace": "We are committed to providing an affirming, safe, and welcoming space for all staff members, patients, clients, visitors, volunteers, subcontractors, and vendors."
    },
    "scrapedAt": "2025-10-26T06:25:49.951Z",
    "rawMarkdown": "[0](https://www.centered.one/cart)\n\n![](https://images.squarespace-cdn.com/content/v1/624c131fd114217bdde13c04/1682685359824-9RUHWAQDURXDZKWK6ZC1/unsplash-image-ktPKyUs3Qjs.jpg)\n\n# **A CENTER FOR**  **INTEGRATIVE HEALING**\n\n**Traditional Therapy**\n\n**Advanced Psychiatric Care**\n\n**Ketamine Assisted Therapy**\n\n# We are Centered.\n\nCentered is a pioneering mental health center offering affordable, multidisciplinary care designed to empower individuals on their path to healing. From traditional therapy to advanced psychiatric care and ketamine-assisted therapy, we provide a full spectrum of services to meet diverse needs. Our mission is to support our community in navigating life's challenges, helping them find balance, purpose, and connection. At Centered, we believe that by embracing personalized and innovative therapeutic approaches, we can help people thrive and live fuller, more meaningful lives.\n\n* * *\n\n[Become A Patient](https://www.centered.one/become-a-patient)\n\n[Info for Providers](https://www.centered.one/become-a-provider)\n\n![](https://images.squarespace-cdn.com/content/v1/624c131fd114217bdde13c04/a3ce5c0d-9f80-4ae5-8fae-5dda5d1d4a3f/newsletter_1.jpg)\n\n### NON-DISCRIMINATION  POLICY\n\n#### SAFE, AFFIRMING, & WELCOMING SPACES\n\nCentered does not and will not discriminate on the basis of race, color, national origin, sex, gender identity or expression, affectional or sexual orientation, age, disability, religion or belief, marital status, veteran status, English language proficiency, or HIV status, in any of our activities or operations.\n\nWe are committed to providing an affirming, safe, and welcoming space for all staff members, patients, clients, visitors, volunteers, subcontractors, and vendors.\n\n![](https://images.squarespace-cdn.com/content/v1/624c131fd114217bdde13c04/9c420536-a4d6-49fc-a1ef-fbf9fa59a559/yoga_bkg_1.jpg)\n\nItem 1 of 18"
  }
}